tutorials/denseAGFoam/fluidizedBed/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions          [ 1 -1 -2 0 0 0 0 ];

internalField       uniform 1e5;

boundaryField
{
    walls
    {
        type               fixedFluxPressure;
        value              $internalField;
    }
    outlet
    {
        type               fixedValue;
        value              $internalField;
    }
    inlet
    {
        type               fixedFluxPressure;
        value              $internalField;
    }
    frontAndBackPlanes
    {
        type               empty;
    }
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
